src/cf/InformationRegisters/НастройкиНумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиНумерации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Нумератор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Нумераторы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНумерации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНумерации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нумеровать</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВопросДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияНумераторов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тематика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТематикиДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УзелКОД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыКОД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проекты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектныеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаименованияОписанияЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мероприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиПроцессов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействиеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СпособыНумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыНумерации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиНумерации/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипыОбъектовДокументыПредприятия = Перечисления.ТипыОбъектов.ДокументыПредприятия;
	
	НумероватьАвтоматически = Перечисления.СпособыНумерации.Автоматически;
	НумероватьВручную = Перечисления.СпособыНумерации.Вручную;
	
	ЗаполнитьТаблицуИзмерений();
	
	НачальнаяЗапись = Новый Структура("ТипДокумента, ВидДокумента, Организация, Подразделение, ВопросДеятельности, Контрагент, Проект");
	ЗаполнитьЗначенияСвойств(НачальнаяЗапись, Запись);
	
	ЭтоНовый = Параметры.Ключ.Пустой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого Строка Из ТаблицаИзмерений Цикл
		Запись[Строка.Имя] = Строка.Значение;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьТаблицуИзмерений();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЗначениеЗаполнено(Запись.ТипДокумента) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не указан ""Тип документа""'"),,"ТаблицаИзмерений[0].Значение",,Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Нумеровать) Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Не указан ""Способ нумерации""'"),,"Нумеровать",,Отказ);
	КонецЕсли;
	
	ИзмеренияИзменились = Ложь;
	Для Каждого Эл Из НачальнаяЗапись Цикл
		Если Эл.Значение <> Запись[Эл.Ключ] Тогда 
			ИзмеренияИзменились = Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	Если ЭтоНовый Или ИзмеренияИзменились Тогда 
		Если ЕстьДубль() Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Для указанных полей ""Действует для"" уже задана настройка нумерации'"),, "ТаблицаИзмерений",, Отказ);
			Возврат;	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НумероватьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Список = Новый СписокЗначений;
	Список.Добавить(НумероватьАвтоматически, НСтр("ru = 'Автоматически'"));
	Список.Добавить(НумероватьВручную, НСтр("ru = 'Вручную'"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"НумероватьНачалоВыбораПродолжение",
		ЭтотОбъект);

	ПоказатьВыборИзСписка(ОписаниеОповещения, Список, Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура НумероватьНачалоВыбораПродолжение(ВыбранныйЭлемент, Параметры) Экспорт 

	Если ВыбранныйЭлемент <> Неопределено Тогда 
		Запись.СпособНумерации = ВыбранныйЭлемент.Значение;
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"СформироватьПолеНумеровать",
			ЭтотОбъект);

		Если Запись.СпособНумерации = НумероватьАвтоматически Тогда 
			ПараметрыФормы =  Новый Структура;
			ПараметрыФормы.Вставить("ТекущаяСтрока", Запись.Нумератор);
			
			ОткрытьФорму("Справочник.Нумераторы.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,
				ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ВыполнитьОбработкуОповещения(ОписаниеОповещения, НумероватьВручную);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПолеНумеровать(ВыбранноеЗначение, Параметры) Экспорт 

	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда 
		Запись.СпособНумерации = Неопределено
	ИначеЕсли ВыбранноеЗначение = НумероватьВручную Тогда  
		Запись.Нумератор = Неопределено;
	Иначе	
		Запись.Нумератор = ВыбранноеЗначение;
	КонецЕсли;	

	Нумеровать = Нумерация.СформироватьПолеНумеровать(Запись.СпособНумерации, Запись.Нумератор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаИзмерений.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТипДокументаЗначение = ТаблицаИзмерений[0].Значение;
	Если ТекущиеДанные.Имя = "ВидДокумента" Тогда 
		
		Если Не ЗначениеЗаполнено(ТипДокументаЗначение) Или ТекущиеДанные.Значение = Неопределено Тогда 
			СтандартнаяОбработка = Ложь;

			ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ВидыДокументов");
			ТекущиеДанные.Значение = ОписаниеТипов.ПривестиЗначение(ТекущиеДанные.Значение);
			
			ОписаниеОповещения = Новый ОписаниеОповещения(
				"ОбработкаВыбораВидаДокумента",
				ЭтотОбъект,
				Новый Структура("ТекущиеДанные", ТекущиеДанные));
	
	 		ТаблицаИзмерений[0].Значение = ТипыОбъектовДокументыПредприятия;
			ОткрытьФорму("Справочник.ВидыДокументов.ФормаВыбора",,,,,, 
				ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	ИначеЕсли ТекущиеДанные.Имя = "ТипДокумента" Тогда 
		
		СтандартнаяОбработка = Ложь;
			
		ОписаниеТипов = Новый ОписаниеТипов("СправочникСсылка.ВидыДокументов");
		
		НайденныеСтроки = ТаблицаИзмерений.НайтиСтроки(Новый Структура("Имя", "ВидДокумента"));
		Если НайденныеСтроки.Количество() > 0 Тогда 
			НайденнаяСтрока = НайденныеСтроки[0];
			НайденнаяСтрока.Значение = ОписаниеТипов.ПривестиЗначение(НайденнаяСтрока.Значение);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораВидаДокумента(ВыбранноеЗначение, Параметры) Экспорт 

	Если ВыбранноеЗначение <> Неопределено Тогда 
		ТаблицаИзмерений[1].Значение = ВыбранноеЗначение;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуИзмерений()
	
	ТаблицаИзмерений.Очистить();
	
	Измерения = Метаданные.РегистрыСведений.НастройкиНумерации.Измерения;
	Для Каждого Измерение Из Измерения Цикл
		ИмяИзмерения = Измерение.Имя;
		
		Если ИмяИзмерения = "Организация" И Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям") Тогда 
			Продолжить;
		ИначеЕсли ИмяИзмерения = "ВопросДеятельности" И Не ПолучитьФункциональнуюОпцию("ИспользоватьВопросыДеятельности") Тогда 
			Продолжить;
		ИначеЕсли ИмяИзмерения = "Проект" И Не ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам") Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаИзмерений.Добавить();
		НоваяСтрока.Имя = ИмяИзмерения;
		НоваяСтрока.Представление = ?(ПустаяСтрока(Измерение.Синоним), ИмяИзмерения, Измерение.Синоним);
		НоваяСтрока.Тип = Измерение.Тип;
		НоваяСтрока.Значение = Запись[ИмяИзмерения];
	КонецЦикла;	
	
	Нумеровать = Нумерация.СформироватьПолеНумеровать(Запись.СпособНумерации, Запись.Нумератор);
	
КонецПроцедуры	

&НаСервере
Функция ЕстьДубль() 
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.НастройкиНумерации.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись);
	
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() Тогда 
		Возврат Истина;	
	КонецЕсли;	
		
	Возврат Ложь;
		
КонецФункции
